FI/Esitiedot/Integraatiopalvelu_Esitiedot_Esimerkkisanoma_addEsitieto_Request_1.3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Tieto.HCW.EIS.Esitiedot.Contracts" xmlns:tem="http://tempuri.org/" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Esitiedot.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:Esitiedot_Sisaan_Request>
         <!--Optional:-->
         <tem:MessageHeader>
            <!--Optional:-->
            <!--type: string-->
            <tiet:MessageID>gero et</tiet:MessageID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:TransactionID>sonoras imperio</tiet:TransactionID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderID>quae divum incedo</tiet:SenderID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderApplication>verrantque per auras</tiet:SenderApplication>
            <!--type: string-->
            <tiet:ReceiverID>per auras</tiet:ReceiverID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ReceiverApplication>circum claustra</tiet:ReceiverApplication>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CharacterSet>nimborum in</tiet:CharacterSet>
            <!--Optional:-->
            <!--type: string-->
            <tiet:DataServiceURL>foedere certo</tiet:DataServiceURL>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserLanguageCode>profundum quippe ferant</tiet:UserLanguageCode>
            <!--Optional:-->
            <!--type: string-->
            <tiet:VersionNumber>et carcere</tiet:VersionNumber>
         </tem:MessageHeader>
         <!--Optional:-->
         <tem:Common>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ContractKey>iovis rapidum iaculata</tiet:ContractKey>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserId>speluncis abdidit</tiet:UserId>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingSystem>bella gero et</tiet:CallingSystem>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingUserId>flammas turbine</tiet:CallingUserId>
         </tem:Common>
         <!--Optional:-->
         <tem:Contact>
            <tiet1:PatientId>
               <!--type: string-->
               <tiet1:Identifier>hoc metuens</tiet1:Identifier>
            </tiet1:PatientId>
            <!--type: dateTime-->
            <tiet1:Created>2014-06-10T21:33:25+03:00</tiet1:Created>
            <!--type: dateTime-->
            <tiet1:Finished>2003-11-10T09:56:46+02:00</tiet1:Finished>
            <!--type: string-->
            <tiet1:FormsetCode>praeterea aut</tiet1:FormsetCode>
            <!--type: string-->
            <tiet1:FormsetCodesystem>claustra fremunt</tiet1:FormsetCodesystem>
            <!--type: string-->
            <tiet1:FormsetName>imperio premit</tiet1:FormsetName>
            <!--type: string-->
            <tiet1:Organisation>quisquam numen</tiet1:Organisation>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:OrganisationOid>ac vinclis</tiet1:OrganisationOid>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:OrgUnit>ac vinclis</tiet1:OrgUnit>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:OrgUnitOid>pectore flammas</tiet1:OrgUnitOid>
            <!--Optional:-->
            <!--type: int-->
            <tiet1:Severity>3</tiet1:Severity>
            <!--Optional:-->
            <!--type: Status - enumeration: [FORMSET_SENT,FORMSET_RECEIVED,DATA_AS_IMAGE]-->
            <tiet1:Status>FORMSET_RECEIVED</tiet1:Status>
            <!--type: string-->
            <tiet1:Originator>austris aeoliam</tiet1:Originator>
         </tem:Contact>
         <!--Optional:-->
         <tem:ContactMetadata>
            <!--Zero or more repetitions:-->
            <tiet1:ContactMetadata>
               <!--type: string-->
               <tiet1:Key>sciret dare</tiet1:Key>
               <!--type: string-->
               <tiet1:Value>dare iussus</tiet1:Value>
            </tiet1:ContactMetadata>
         </tem:ContactMetadata>
         <!--Optional:-->
         <tem:Forms>
            <!--Zero or more repetitions:-->
            <tiet1:Form>
               <!--type: string-->
               <tiet1:FormCode>bella gero</tiet1:FormCode>
               <!--type: string-->
               <tiet1:FormCodeSystem>dedit qui foedere</tiet1:FormCodeSystem>
               <!--type: string-->
               <tiet1:FormName>magno cum</tiet1:FormName>
               <!--Optional:-->
               <!--type: int-->
               <tiet1:Order>3</tiet1:Order>
               <!--Optional:-->
               <!--type: int-->
               <tiet1:Severity>3</tiet1:Severity>
               <tiet1:Questions>
                  <!--Zero or more repetitions:-->
                  <tiet1:Question>
                     <!--type: string-->
                     <tiet1:QuestionCode>ac terras</tiet1:QuestionCode>
                     <!--type: string-->
                     <tiet1:QuestionCodeSystem>regemque dedit</tiet1:QuestionCodeSystem>
                     <!--type: string-->
                     <tiet1:QuestionText>infixit acuto</tiet1:QuestionText>
                     <!--Optional:-->
                     <!--type: int-->
                     <tiet1:Order>3</tiet1:Order>
                     <!--Optional:-->
                     <!--type: string-->
                     <tiet1:Language>tenens mollitque animos</tiet1:Language>
                     <!--Optional:-->
                     <!--type: int-->
                     <tiet1:Severity>3</tiet1:Severity>
                     <!--Optional:-->
                     <!--type: string-->
                     <tiet1:ParentQuestion>montis insuper</tiet1:ParentQuestion>
                     <!--Optional:-->
                     <tiet1:Answer>
                        <!--Optional:-->
                        <!--type: string-->
                        <tiet1:AnswerCode>habenas ipsa</tiet1:AnswerCode>
                        <!--Optional:-->
                        <!--type: string-->
                        <tiet1:AnswerCodeSystem>mollitque animos</tiet1:AnswerCodeSystem>
                        <!--type: string-->
                        <tiet1:AnswerText>iovisque et</tiet1:AnswerText>
                     </tiet1:Answer>
                  </tiet1:Question>
               </tiet1:Questions>
            </tiet1:Form>
         </tem:Forms>
      </urn:Esitiedot_Sisaan_Request>
   </soapenv:Body>
</soapenv:Envelope>